<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class CreateBikePathsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {       
        $array_bike_path_name = [
            "省道台1線(後壁-新市段)自行車道",
            "白河蓮鄉自行車道",
            "嘉南大圳新營支線與舊鐵道自行車道",
            "小南海自行車道",
            "八田自行車道",
            "七股潟湖自行車道",
            "七股自行車道",
            "新化自行車道",
            "台江大道5-3段自行車道",
            "台17線(市道173線-高雄市界)自行車道",
            "台江海岸觀光自行車道",
            "美麗公園道自行車道",
            "環運河自行車道",
            "安平海岸觀光自行車道",
            "海洋休閒線自行車道",
            "黃金海岸觀光自行車道",
            "虎山路自行車道",
            "北門-井仔腳自行車道",
            "扇形鹽田自行車道",
            "將軍溪堤岸自行車道",
            "西拉雅自行車道",
            "山海圳綠道",
            "民生路及孔廟文化園區自行車道",
            "學甲糖鐵自行車道",
            "興化舊台糖鐵道自行車道",
            "太康綠色隧道自行車道",
            "糖鐵自行車道通勤綠廊",
            "八甲段自行車道",
            "下營絲綠自行車道",
            "臺南科學園區自行車道",
            "柳營科學園區外環車道",
            "樹谷園區自行車道",
            "雙博物館自行車道",
            "急水溪堤防景觀步道",
            "五分車自行車道",
            "菱波官田雉由行自行車道",
            "東山區台糖鐵道改造自行車道",
            "北佳里糖鐵自行車道",
            "後壁白河米蘭蓮花線自行車道",
            "南68線自行車道",
            "菱波官田(公所段)",
            "後壁糖鐵自行車道",
            "查畝營鐵馬道",
            "鹽水糖鐵綠廊道"
        ];

        $array_district = [
            "後壁區、新營區、柳營區、六甲區、官田區、善化區及新市區",
            "白河區",
            "後壁區、新營區",
            "後壁區、白河區",
            "官田區",
            "七股區",
            "七股區",
            "新化區",
            "安南區",
            "安南區",
            "安南區",
            "北區、東區、南區、中西區",
            "安平區",
            "安平區",
            "安平區",
            "南區",
            "仁德區",
            "北門區",
            "將軍區",
            "將軍區、學甲區",
            "六甲區、官田區、柳營區、東山區、白河區",
            "安南區、新市區、善化區、官田區",
            "中西區",
            "學甲區",
            "佳里區",
            "柳營區",
            "新營區",
            "歸仁區",
            "下營區",
            "新市區、善化區、安定區",
            "柳營區",
            "新市區",
            "安南區、新市區、安平區、南區、仁德區",
            "北門區、學甲區",
            "官田區",
            "官田區",
            "東山區",
            "佳里區",
            "白河區、後壁區",
            "六甲區",
            "官田區",
            "後壁區",
            "柳營區",
            "鹽水區"
        ];

        $array_length = [
            "43.2",
            "42",
            "6",
            "13.8",
            "6",
            "1.8",
            "19",
            "37.4",
            "5.7",
            "22.6",
            "56.1",
            "12.6",
            "20",
            "3.7",
            "6.3",
            "9.8",
            "2.6",
            "18",
            "1.9",
            "9.4",
            "74",
            "45",
            "6.2",
            "2.5",
            "1.035",
            "4.5",
            "3.5",
            "4.8",
            "5.2",
            "68.9",
            "9.7",
            "22",
            "40",
            "3.5",
            "0.8",
            "23",
            "4.7",
            "1.336",
            "29.26",
            "1.032",
            "7.5",
            "5.87",
            "30.2",
            "3.18"
        ];

        $array_nearby_attractions = [
            "新營天鵝湖、新營糖廠、隆田酒廠、善化啤酒廠",
            "蓮花資訊館、蓮花公園、小南海",
            "烏樹林糖廠、五分車站",
            "蘭花生技園區、普陀寺、小南海上茄苳埤、將軍埤",
            "八田與一紀念園區、烏山頭水庫風景區、嘉南大圳出水口景觀台、赤山龍湖巖",
            "觀海樓、七股潟湖及鹽田風貌",
            "海寮龍海宮、海寮紅樹林驛站、南灣觀光碼頭",
            "虎頭埤風景區、木架山",
            "中信金融管理學院",
            "銜接台江海岸觀光自行車道",
            "鹿耳門聖母廟、鄭成功紀念公園、鹿耳門天后宮、鎮門宮、鹽田生態文化村、四草大眾廟、台江碼頭",
            "忠烈祠、市立體育場、水萍塭公園、大天后宮、赤崁樓、連雅堂紀念公園及延平郡王祠",
            "臺南市政府、札哈木公園、林默娘公園及億載金城",
            "橋頭海灘公園、安平燈塔及觀夕平台",
            "安平古堡、安平小砲臺、湖濱水鳥公園",
            "鯤喜灣文化園區遊客服務中心(船屋)",
            "都會公園、奇美博物館",
            "北門遊客中心、水晶教堂",
            "將軍漁港",
            "將軍溪",
            "烏山頭水庫風景區、臺南藝術大學",
            "南科園區、烏山頭水庫、臺灣歷史博物館",
            "孔廟、臺南大學",
            "大灣車站遺址",
            "蕭?文化園區",
            "柳營科技園區",
            "天鵝湖、新營車站",
            "歸仁運動公園",
            "下營國中與地方聚落",
            "臺南科學工業園區、霞客湖、道爺湖、新港社文化園區",
            "柳營科技園區",
            "樹谷生活科學館",
            "臺灣歷史博物館、乾隆海堤、臺南運河、安平古堡、安平漁港、德陽艦、億載金城、奇美博物館",
            "頑皮世界野生動物園、慈濟宮以及上白醮、蜀葵花季等",
            "水雉生態教育園區",
            "葫蘆埤生態景觀、官田水雉生態、嘉南大圳水利工程、烏山頭水庫（八田與一紀念館）",
            "東山咖啡文化中心、?廠咖啡廣場、枋仔?公園",
            "圳道、五分?道及古厝",
            "小南海風景區、蓮花公園、林初埤木棉花道、玉豐、竹門綠色隧道，順遊後壁區(菁寮老街、菁寮天主堂、土溝農村美術館、烏樹林休閒園區)、白河區(關子嶺溫泉區)等",
            "林鳳營故事館、菁埔埤、林鳳營牧場落羽松林、林鳳營車站、農業文化展示館",
            "戀占石、赤山龍湖巖、隆田酒廠",
            "後壁菁寮老街",
            "綠色隧道、大腳腿村落、小腳腿村落、尖山埤、果毅後、德元埤、柳營環保科技工業園區、柳營代天院、劉家古厝、八翁酪農區、八老爺牧場、吳晉淮音樂紀念館",
            "鹽水月津港、舊台糖鹽水車站"
        ];

        $bike_path_name = $array_bike_path_name[array_rand($array_bike_path_name)];
        $district = $array_district[array_rand($array_district)];
        $length = $array_length[array_rand($array_length)];
        $nearby_attractions = $array_nearby_attractions[array_rand($array_nearby_attractions)];
        
        for ($i = 0; $i < 30; $i++) 
        {
            DB::table('bike_paths')->insert([
                'bike_path_name' => $array_bike_path_name[array_rand($array_bike_path_name)],
                'district' => $array_district[array_rand($array_district)],
                'length' => $array_length[array_rand($array_length)],
                'nearby_attractions' => $array_nearby_attractions[array_rand($array_nearby_attractions)],
            ]);
        }
    }
}